{
  "title": "Enbrighten Zigbee Smart Light Switch, QuickFit & SimpleWire, Pairs Directly with Echo Show 10, Echo Studio, Eero Pro 6, Alexa & Google Assistant, Smart Light Switch, 43078",
  "location": "Delivering to Rochester 03867",
  "product_information": {
    "Operation Mode": "ON-OFF",
    "Current Rating": "15 Amps",
    "Operating Voltage": "120 Volts",
    "Contact Type": "Normally Open",
    "Connector Type": "Clamp",
    "Brand": "Enbrighten",
    "Terminal": "Electrical",
    "Item dimensions L x W x H": "2.6 x 3.05 x 6.05 inches",
    "Circuit Type": "2-way",
    "Actuator Type": "Rocker Switch",
    "Contact Material": "Metal",
    "International Protection Rating": "IP00",
    "Number of Positions": "1",
    "Lower Temperature Rating": "32 Degrees Fahrenheit",
    "Upper Temperature Rating": "104 Degrees Fahrenheit",
    "Controller Type": "Wink, Google Assistant, Amazon Alexa, SmartThings, nest",
    "Control Method": "Voice",
    "Connectivity Protocol": "ZigBee",
    "Color": "White & Light Almond",
    "Wattage": "6E+2",
    "Unit Count": "1.0 Count",
    "Number of Items": "1",
    "Manufacturer": "Jasco Products Company, LLC",
    "UPC": "030878430784",
    "Part Number": "43078",
    "Item Weight": "5.9 ounces",
    "Product Dimensions": "2.6 x 3.05 x 6.05 inches",
    "Country of Origin": "China",
    "Item model number": "43078",
    "Size": "1 Pack",
    "Style": "Zigbee Switch",
    "Power Source": "Corded Electric",
    "Voltage": "120 Volts (AC)",
    "Item Package Quantity": "1",
    "Number Of Pieces": "1",
    "Measurement System": "Imperial",
    "Usage": "Electrical, Lighting, Fans",
    "Included Components": "Smart Switch",
    "Batteries Required": "No",
    "Warranty Description": "5-year limited warranty",
    "ASIN": "B08Q4F43HT",
    "Customer Reviews": {
      "ratings_count": "100 ratings",
      "stars": "4.2"
    },
    "Best Sellers Rank": "#66,242 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement)   #221 in Electrical Light Switches",
    "Date First Available": "December 8, 2020"
  },
  "brand": "Enbrighten Store",
  "brand_url": "/stores/Enbrighten/page/4E40A2CB-82CA-48BB-ACBA-D50367E43183?is_byline_deeplink=true&deeplink=E744DDD3-07A5-4B5A-89EA-3844DA36D993&redirect_store_id=4E40A2CB-82CA-48BB-ACBA-D50367E43183&lp_asin=B08Q4F43HT&ref_=ast_bln&store_ref=bl_ast_dp_brandLogo_sto",
  "description": "Your entire home is smarter with the Enbrighten Zigbee In-Wall Smart Switch with QuickFit™ and SimpleWire™. Enjoy extensive control of permanently installed lights, fans and other fixtures when paired with a compatible gateway. For further convenience, the smart switch connects directly to the latest Amazon Alexa products, including Echo Studio and Echo Show 10 as well as first- and second-generation Echo Plus, for voice commands. Voice control and remote operation using additional devices is also available through Zigbee-compatible hubs.",
  "price": "$41.49",
  "list_price": "$41.49",
  "exact_price": "",
  "other_used_pricing": "",
  "price_symbol": "$",
  "is_prime_exclusive": false,
  "is_frequently_returned": false,
  "number_of_people_bought": "100+ bought in past month",
  "shipping_info": "FREE Wednesday, June 11 ",
  "availability_status": "In Stock",
  "aplus": true,
  "previous_price": "",
  "is_coupon_exists": false,
  "coupon_text": "",
  "main_image": "https://m.media-amazon.com/images/I/81LvXoZ8npL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
  "images_of_specified_asin": [
    "https://m.media-amazon.com/images/I/81LvXoZ8npL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AU61u0OyL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Bp7BggsxL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iykAo1xCL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81doiCN-X-L._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81d+CNzL2bL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EVz0QvXPL._AC_SL1500_.jpg"
  ],
  "images": [
    "https://m.media-amazon.com/images/I/81LvXoZ8npL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81AU61u0OyL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Bp7BggsxL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81iykAo1xCL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81doiCN-X-L._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81d+CNzL2bL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81EVz0QvXPL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51ejpZghHbL._AC_SL1001_.jpg",
    "https://m.media-amazon.com/images/I/81i7XRmloKL._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81Rubbmh29L._AC_SL1500_.jpg",
    "https://m.media-amazon.com/images/I/81VZfzh+W4L._AC_SL1500_.jpg"
  ],
  "number_of_videos": 0,
  "product_category": "Tools & Home Improvement›Electrical›Switches & Dimmers›Wall Switches›Light Switches",
  "category_id": "6291359011",
  "average_rating": "4.2",
  "feature_bullets": [
    "Revolutionary, patent-pending design – QuickFit and SimpleWire technologies offer groundbreaking home automation features. Unique advancements make the smart controls easier to install and more reliable than ever.",
    "QuickFit – Improved components reduced the housing depth by up to 20% compared to previous Zigbee models and eliminated the need for break-off tabs. QuickFit enhancements are the ideal smart solution for older-style switch boxes, multi-gang configurations or any other application with limited space.",
    "SimpleWire – Auto-detecting line/load terminals support fast installation by identifying line and load wires and configuring the switch accordingly. Dual ground ports, which are offset to avoid switch box mounting screws, support daisy-chaining in multi-switch setups.",
    "Voice control – Pair directly with 1st and 2nd generation Echo Plus, Echo Show 10, or Echo Studio immediately out of the package for easy voice command of connected devices. No additional equipment is required for use with these Echo models. Other Amazon Alexa and Google Assistant products can also be used for voice control when connected through a compatible Zigbee hub.",
    "Energy monitoring – Stay informed of energy use when paired with a compatible hub. Energy-monitoring readings and functions vary based on hub capabilities."
  ],
  "total_reviews": "100 ratings",
  "total_answered_questions": "",
  "other_sellers": [],
  "customization_options": {
    "color": [],
    "size": [],
    "style": []
  },
  "merchant_info": "SoldbyAmazonResaleandFulfilledbyAmazon.",
  "ships_from": "Amazon.comAmazon.comShipsfromAmazon.com",
  "sold_by": "Amazon.com",
  "author": {
    "title": "",
    "description": "                     Color:\n      White & Light Almond          Style:\n      Zigbee Switch             Previous page                    \n                  Zigbee Switch+ Dimmer          \n              $80.36  \n        \n             \n         \n                    Next page     var postCsmCountMetric = function postCountMetric(metricName, value) {if (window.ue) {ue.count(metricName, value); } }; try {P.when(\"A\").execute('vse-vw-dp-card', function(A) {var widget = A.$('.vse-vw-dp' ); if (widget.length) {var isMetricRecorded = false; var widgetInViewMetrics = function widgetInViewMetrics () {if (isMetricRecorded) {A.off('scroll', widgetInViewMetrics); return; } if (A.onScreen(widget, 0)) {var requestId = window.ue ? window.ue.id : ''; if (false) {var successCallback = function () {postCsmCountMetric('ive:csm:widgetScrolledInView:weblabTriggerBatchRequestSuccess:vse-vw-dp-card', 1); }; var errorCallback = function () {postCsmCountMetric('ive:csm:widgetScrolledInView:weblabTriggerBatchRequestError:vse-vw-dp-card', 1); }; postCsmCountMetric('ive:csm:widgetScrolledInView:weblabTriggerBatchRequest:vse-vw-dp-card', 1); var payload = {weblabNames: [], requestId: requestId }; A.ajax(\"/vap/ew/weblabtrigger/batch/v2\", {params: payload, paramsFormat: 'json', crossDomain: true, method: 'POST', withCredentials: true, contentType: 'application/json', success: successCallback, error: errorCallback }); isMetricRecorded = true; } if (false) {if (window.ue.trigger) {var triggerInCsmWeblab = ''; if (triggerInCsmWeblab.indexOf(':') !== -1) {var weblabNameAndTreatment = triggerInCsmWeblab.split(':'); window.ue.trigger(weblabNameAndTreatment[0], weblabNameAndTreatment[1]); postCsmCountMetric('ive:csm:widgetScrolledInView:csmWeblabTrigger:vse-vw-dp-card:', 1); } } } } }; A.on('scroll', widgetInViewMetrics); } }); } catch (exception) {postCsmCountMetric('vse-vw-dp-card' + 'weblabTrigger:exception'); if (window.ueLogError) {var message = 'Exception when trigger Weblab on scroll into the view '; if (false) {message += ''; } var additionalInfo = {logLevel: 'ERROR', attribution: 'ive-trigger-on-scroll', message: message }; window.ueLogError(exception, additionalInfo); } } VideosHelp others learn more about this product by uploading a video!Upload your video"
  },
  "customers_freuqently_viewed": [],
  "products_related_to_this_item": [],
  "customer_who_bought_this_item_also_bought": [],
  "customers_say": "Customers find the smart light switch works well, with one mentioning it handles both standard and 3-way switches effectively. The device is easy to install, with one customer noting it includes multiple wiring configurations, and they appreciate its responsiveness and reliability. They like its compatibility, with one mentioning seamless integration with their Home Assistant setup. While customers find it well-made, some consider it overpriced.AI Generated from the text of customer reviews",
  "customer_sentiments": [
    {
      "title": "Functionality",
      "sentiment": "POSITIVE"
    },
    {
      "title": "Ease of installation",
      "sentiment": "POSITIVE"
    },
    {
      "title": "Responsiveness",
      "sentiment": "POSITIVE"
    },
    {
      "title": "Compatibility",
      "sentiment": "POSITIVE"
    },
    {
      "title": "Reliability",
      "sentiment": "POSITIVE"
    },
    {
      "title": "Home assistant",
      "sentiment": "POSITIVE"
    },
    {
      "title": "Value for money",
      "sentiment": "NEGATIVE"
    }
  ],
  "ratings_distribution": [
    {
      "rating": 5,
      "distribution": "69"
    },
    {
      "rating": 4,
      "distribution": "15"
    },
    {
      "rating": 3,
      "distribution": "3"
    },
    {
      "rating": 2,
      "distribution": "1"
    },
    {
      "rating": 1,
      "distribution": "12"
    }
  ],
  "customer_reviews": [
    {
      "customer_name": "diamond",
      "customer_profile": "/gp/profile/amzn1.account.AFX3752A4KJO5JJFRKLBKX7OGBNA/ref=cm_cr_dp_d_gw_tr?ie=UTF8",
      "thumbnail": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
      "rating": "5.0 out of 5 stars",
      "review_title": "5.0 out of 5 starsSolves a problem automating my 3-way light wiring!",
      "date": "Reviewed in the United States on January 25, 2025",
      "review_snippet": "Searched far and wide for a 3-way switch solution that could meet my criteria.- Had to match the ivory color decor of all the other switches in our home.- I wanted to avoid wifi switches and stick to Zigbee.  I've already got HomeKit, Home Assistant with Zigbee and Phillips Hue in the house so I wanted to avoid another hub.- Had to work with my wiring.  More on that below.  Note: this is referring to wiring in the USA.Now of course since I already have Hue I could have replaced all of the recessed ceiling lights in the room with Hue and gone with Hue switches but with 9 fixtures on just this one 3-way that would have cost a fortune!  I just wanted to automate the switch and keep the existing lights.The included ivory switch paddle was super easy to swap out.  I also purchased the matching add-on switch for the 3-way setup which also included an ivory paddle.  The total cost def higher than Zigbee relays I've been using for single switch automation but there is no way I could get those to work with my 3-way wiring.Installation was pretty easy.  The issue with my 3-way wiring is the supply is in first box and the load in the other \"end of run\" box.  The end of run box had no supply in it.  Luckily this smart switch only needs one of the two existing traveler wires to connect to the add-on switch so I was able to use the second traveler (I used the black) to transfer supply to the end of run box (where the load is) and put the smart switch there.  The add-on switch went in the box with the supply and connected to the smart switch via the red traveler.  The installation instructions include a number of wiring configurations and overall are pretty good.  However if this configuration was shown in the directions I didn't see it.  That said it wasn't hard to figure out.  I looked at a lot of other options and none of them could handle this scenario.I also really like the fact this switch uses momentary contact on/off.  I find that to be a tad more intuitive than \"dumb\" 3-way switches where one switch is always in the \"on\" position.The blue led on the smart switch is on by default when the light is off and it is pretty bright.  This is ok for some rooms however I would not want this in a bedroom.  It is easy to change the behavior so the led is on when the light is on and off when the light is off.  Press 'on' 3 times quickly then 'off' on the smart switch.  This toggles the led behavior.Hopefully it lasts.  Time will tell.  Just one minor con:  The included ivory switch paddle is a tad lighter in shade than my other switches and switch plates.  But it's a minor difference and no where near as ugly as a white switch would have looked.  The wife says that is just my OCD showing and of course she's right.I will be purchasing more of these to automate additional 3 & 4 way switch setups in the house."
    },
    {
      "customer_name": "August West",
      "customer_profile": "/gp/profile/amzn1.account.AGPIQYWFI45K6K4QRING6LCM33NQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8",
      "thumbnail": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
      "rating": "5.0 out of 5 stars",
      "review_title": "5.0 out of 5 starsWork Great With Home Assistant",
      "date": "Reviewed in the United States on May 26, 2025",
      "review_snippet": "I've installed 14 of these around the house so far and 3 of the companion switches for 3 & 4 way lighting circuits. They were easy to install (need a neutral wire but that is normal for smart switches), well made and paired instantly with the Zigbee integration on Home Assistant. They provide basic power monitoring (instantaneous and summation) and function as Zigbee routers which helps provide a stable network. So far their function and been flawless."
    },
    {
      "customer_name": "meine39meine39",
      "customer_profile": "/gp/profile/amzn1.account.AH5DSMNQ377JMIWMOLZ5224YULDQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8",
      "thumbnail": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
      "rating": "4.0 out of 5 stars4.0 out of 5 stars",
      "review_title": "4.0 out of 5 starsEnbrighten Zigbee Smart Light Switch",
      "date": "Reviewed in the United States on January 13, 2025",
      "review_snippet": "I installed this switch at my back door to control external porch lights.  I have a number of Zigbee devices in my home, namely Aqara door/window sensors that I use to control a variety of door related automations.  While Aqara does offer an equivalent Zigbee wall switch to this Enbrighten model, the Aqara switch has a Decora sized on/off pushbutton switch that is not particularly attractive and has a mushy feel to it.  I like that this Enbrighten switch has a more standard looking paddle appearance to it, making it \"blend in\" better with existing \"dumb\" paddle switches in my multi-gang box, and offering a more intuitive appearance and operation similar to a \"dumb\" paddle for those unfamiliar with smart switches.The switch installs easily, and I like that it has multiple wire entries at each screw terminal - the screw terminals are a clamp down style, meaning straight wires push in on either side of the screw terminal, and the screw tightens down on the wires, holding them firmly in place.  I was able to unbundle my 2 wire-nutted \"hots\" and use one of the hot terminal screws to capture both of them, eliminating the need for a pigtail to be added to the \"hot\" bundle and run to the switch - the screw terminal captures \"pass through\" duties for the hot wires and also powers the switch - good stuff.ALL connections are done via screw terminals(hot, switched, neutral and ground), meaning no wire leads coming off the switch itself, which I find leads to better cable management within the box.  I did add a white \"pigtail\" lead off the neutral bundle by twisting the pigtail on to that bundle and replacing the wire nut, as the white bundle contained more than two wires.I added the switch via a Zigbee dongle and ZHA to my Home Assistant box - pairing was easy, when I opened up the \"add device\" option in HA, the switch immediately advertised itself to the Zigbee dongle, without any need to put the switch in to any kind of pairing mode.  I did not bother adding any kind of Enbrighten app to my phone - the switch paired locally and that's exactly what I am looking for as I pursue an entirely local smart home.Being a mains-wired Zigbee device, this switch acts as a Zigbee radio/repeater - I have an Aqara door/window sensor in my curbside mailbox, and it easily joined to the switch's radio/repeater to facilitate my \"You've got mail\" automation that announces the mail's arrival on my voice assistant.  Previously, I had an Aqara smart plug providing this radio/repeater connectivity to the mailbox, but I wanted an in-wall switch as the smart plug was serving no other function other than to act as a radio/repeater to the mailbox.I exposed the switch to Alexa through my Nabu Kasa account in order to integrate it with a eufy doorbell cam so that the porch light controlled by this switch can be turned on overnight if the doorbell detects motion.  The switch is also controlled by a HA automation, which turns the same porch light on at dusk and off at 10PM - everything is working fine.Please note that the switch has a blue LED - by default, it is on when the switch is off, and off when the switch is on - that can easily be overridden to on when on and off when off by 3 rapid \"on\" presses of the upper paddle followed by a single press of the off paddle.  I prefer the blue LED to be off when the light is off, and this would be especially true in a bedroom, where I imagine it would be quite annoying to have the blue LED glowing when trying to sleep.  Reviewers complaining about the blue LED should be aware of this.This switch is a bit pricy, but the Aqara version is similarly priced, and as I mentioned, I think the Enbrighten has a more intuitive and ergonomic feel to it versus Aqara's giant mushy pushbutton approach."
    },
    {
      "customer_name": "J",
      "customer_profile": "/gp/profile/amzn1.account.AG7SHKTGCN2K7R5DEIK332QQ3ZFA/ref=cm_cr_dp_d_gw_tr?ie=UTF8",
      "thumbnail": "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
      "rating": "5.0 out of 5 stars",
      "review_title": "5.0 out of 5 starsI'm a loser for loving these!",
      "date": "Reviewed in the United States on April 3, 2025",
      "review_snippet": "These work great for standard or 3 way switches.  Act as zigbee routers which saved my zigbee network from ruin.  Replacing some older wifi switches with these guys.  A little spendy but I don't do anything else but work and fiddle with my home anymore. Don't judge!!! Ok fine I'm a loser!!!"
    }
  ]
}